boblow45/pic16f18446/code/UART.X/src/usart.c
#include <xc.h> 
#include <stdbool.h>

#include "./../inc/usart.h"

volatile uint8_t uart_bytes = 0;
volatile char * uart_data;

#define TX_BUFF_SIZE (16)
#define RX_BUFF_SIZE (8)

char tx_buff[TX_BUFF_SIZE];

struct cbuff_s{
    uint8_t head;
    uint8_t tail;
    uint8_t size;
    bool full;
};

struct cbuff_s cbuff_tx;

static void buff_init(struct cbuff_s * cbuf, uint8_t size){
    cbuf->head = 0;
    cbuf->tail = 0;
    cbuf->size = size;
    cbuf->full = false;
}

static bool buf_empty(struct cbuff_s * cbuf) {
	return (!cbuf->full && (cbuf->head == cbuf->tail));
}

static void buf_put(struct cbuff_s * cbuf, char data){
    tx_buff[cbuf->head] = data;
    cbuf->head = (cbuf->head + 1) % cbuf->size;

    if(cbuf->full){
        cbuf->tail = (cbuf->tail + 1) % cbuf->size;
    }
    cbuf->full = (cbuf->head == cbuf->tail)? true: false;
}

static char buf_get(struct cbuff_s * cbuf){
    char data;
    data = tx_buff[cbuf->head];
    cbuf->full = false;
    cbuf->tail = (cbuf->tail + 1) % cbuf->size;
    return data;
}


void usart_write(char *data, uint8_t len){
    
    for(uint8_t i=0; i<len; i++){
        while(tx_full){}
        buf_put(&cbuff_tx, data[i]);
        PIE3bits.TX1IE = 1;
    }
}

void usart_init(void){
    // disable interrupts before changing states
    PIE3bits.RC1IE = 0;
    PIE3bits.TX1IE = 0;
    
    buff_init(&cbuff_tx, TX_BUFF_SIZE);
    
    TRISBbits.TRISB4 = 1;       // Set RB4 as output
    RX1PPSbits.PORT = 0b01;     // Port B
    RX1PPSbits.PIN  = 5;        // Pin 5
            
    RB4PPS = 0b001111;          // Set Port B4 to TX1 

    // ABDOVF no_overflow; SCKP Non-Inverted; BRG16 16bit_generator; WUE disabled; ABDEN disabled; 
    BAUD1CON = 0x08;

    // SPEN enabled; RX9 8-bit; CREN enabled; ADDEN disabled; SREN disabled; 
    RC1STA = 0x90;

    // TX9 8-bit; TX9D 0; SENDB sync_break_complete; TXEN enabled; SYNC asynchronous; BRGH hi_speed; CSRC slave; 
    TX1STA = 0x24;

    // SP1BRGL 51; 
    SP1BRGL = 51;

    // SP1BRGH 0; 
    SP1BRGH = 0x00;
  
    INTCONbits.GIE = 1;         // Enable the interrupt system
    INTCONbits.PEIE = 1;        // Enable interrupts from peripherals
    //PIE3bits.RC1IE = 1;
}

void usart_tx_irq(void){
    TX1REG = buf_get(&cbuff_tx);
    if(buf_empty(&cbuff_tx)){
        PIE3bits.TX1IE = 0;
    }
}
